#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
aws_security_group_rule.rdx_public_security_group_rules[1]: Refreshing state... [id=sgrule-1908366209]
data.aws_ami.ubuntu: Reading...
aws_security_group_rule.rdx_public_security_group_rules[0]: Refreshing state... [id=sgrule-2419683160]
data.aws_availability_zones.available: Reading...
aws_vpc.rdx_vpc: Refreshing state... [id=vpc-0edb9bba53f55f8fe]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0778521d914d23bc1]
aws_security_group.rdx_private_security_group: Refreshing state... [id=sg-0924c2dbdfcc6f2af]
aws_subnet.rdx_public_subnet[0]: Refreshing state... [id=subnet-01e143b274e35ec63]
aws_security_group.rdx_public_security_group: Refreshing state... [id=sg-02a149582c8af1ae9]
aws_route_table.rdx_private_route_table: Refreshing state... [id=rtb-0f592ddb8ecb82199]
aws_subnet.rdx_private_subnet[0]: Refreshing state... [id=subnet-0f47f309091fec62b]
aws_subnet.rdx_private_subnet[1]: Refreshing state... [id=subnet-00ce39dd2681afdd4]
aws_internet_gateway.rdx_internet_gateway: Refreshing state... [id=igw-081528632e757d80c]
aws_route_table.rdx_public_route_table: Refreshing state... [id=rtb-0ecdfc14b521bb0e7]
aws_security_group_rule.rdx_private_security_group_rules[0]: Refreshing state... [id=sgrule-693558744]
aws_db_subnet_group.rdx_private_subnet_group: Refreshing state... [id=rdx_private_subnet_group]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a30f4b737d843930]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03b65ee4c1630c0a5]
aws_instance.full_node_ec2[0]: Refreshing state... [id=i-003fd9e41060ef848]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0974b98fb5ccd788f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_security_group_rule.rdx_public_security_group_rules[0] will be destroyed
  # (because aws_security_group_rule.rdx_public_security_group_rules is not in configuration)
  - resource "aws_security_group_rule" "rdx_public_security_group_rules" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow HTTPS traffic" -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-2419683160" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-02a149582c8af1ae9" -> null
      - security_group_rule_id = "sgr-007e881a2aa06213d" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "ingress" -> null
    }

  # aws_security_group_rule.rdx_public_security_group_rules[1] will be destroyed
  # (because aws_security_group_rule.rdx_public_security_group_rules is not in configuration)
  - resource "aws_security_group_rule" "rdx_public_security_group_rules" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow traffic on port 30000" -> null
      - from_port              = 30000 -> null
      - id                     = "sgrule-1908366209" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-02a149582c8af1ae9" -> null
      - security_group_rule_id = "sgr-00b1b084c9a3c5630" -> null
      - self                   = false -> null
      - to_port                = 30000 -> null
      - type                   = "ingress" -> null
    }

  # aws_security_group_rule.rdx_public_security_group_rules_egress[0] will be created
  + resource "aws_security_group_rule" "rdx_public_security_group_rules_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = "sg-02a149582c8af1ae9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.rdx_public_security_group_rules_ingress[0] will be created
  + resource "aws_security_group_rule" "rdx_public_security_group_rules_ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow HTTPS traffic"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-02a149582c8af1ae9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.rdx_public_security_group_rules_ingress[1] will be created
  + resource "aws_security_group_rule" "rdx_public_security_group_rules_ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow traffic on port 30000"
      + from_port                = 30000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-02a149582c8af1ae9"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 30000
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @StatelessOddity, Action: `pull_request`*